LonelyWolf/stm32/bike-computer/main.c
///////////////////
// STM32L151RBT6 //
///////////////////


/////////////////////////////////////////////////////////////////////////

#define DEBUG

/////////////////////////////////////////////////////////////////////////


#include <misc.h>
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_gpio.h>
#include <stm32l1xx_pwr.h>
#include <stm32l1xx_rtc.h>
#include <stm32l1xx_exti.h>
#include <stm32l1xx_tim.h>
#include <stm32l1xx_usart.h>
#include <stm32l1xx_syscfg.h>
#include <stm32l1xx_dma.h>
#include <string.h> // For memset, memmove
#include <math.h>

#include <wolk.h>
#include <delay.h>
#include <spi.h>
#include <i2c.h>
#include <uart.h>
#include <uc1701.h>
#include <nRF24.h>
#include <bmp180.h>
#include <RTC.h>
#include <GUI.h>
#include <GPS.h>
#include <resources.h>


/////////////////////////////////////////////////////////////////////////


#define LCD_BACKLIGHT_TIMEOUT           60  // Timeout for LCD backlight (seconds)
#define ALT_MEASURE_DUTY_CYCLE          30  // Temperature/pressure measurement duty cycle (seconds)
#define NO_SIGNAL_TIME                  10  // Sensor signal timeout

uint8_t nRF24_RX_Buf[nRF24_RX_PAYLOAD];     // nRF24L01 payload buffer

bool _new_packet;                           // TRUE if new packet was received but not parsed
bool _new_time;                             // TRUE if time was updated
bool _bmp180_present;                       // TRUE if BMP180 sensor responded on I2C bus

bool _RF_icon;                              // Flag for RF icon flashing

uint16_t _prev_cntr_SPD;                    // Last received cntr_SPD value
uint16_t _prev_tim_SPD;                     // Last received tim_SPD value
uint16_t _tim_excess;                       // Timer excess from 1 second ratio
uint32_t _cntr_cadence;                     // Cadence counter (for AVG calculation)
uint32_t _cadence_accum;                    // Cadence accumulator (for AVG calculation)

RTC_TimeTypeDef RTC_Time;                   // Current RTC time
RTC_DateTypeDef RTC_Date;                   // Current RTC date

uint32_t _no_signal_time;                   // Time since last packet received (seconds)
uint32_t _idle_time;                        // Time from last user event (button press)

int16_t altitude_history[128];              // Last 128 altitude values
uint8_t _altitude_duty_cycle;               // Altitude measurement duty cycle

uint16_t _DMA_cntr;                         // Last value of UART RX DMA counter (to track RX timeout)

uint32_t i;                                 // THIS IS UNIVERSAL VARIABLE
uint32_t ccc;                               // Wakeups count, for debug purposes

// Peripherals initialization variables
GPIO_InitTypeDef PORT;
EXTI_InitTypeDef EXTIInit;
NVIC_InitTypeDef NVICInit;
DMA_InitTypeDef  DMAInit;


/////////////////////////////////////////////////////////////////////////


void ParsePacket(void);
void ParseGPS(void);
bool UpdateBMP180(void);


/////////////////////////////////////////////////////////////////////////


// EXTI[5..9] lines IRQ handler
void EXTI9_5_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;

	if (EXTI_GetITStatus(EXTI_Line5) != RESET) {
		// EXTI5 (Button#1 -> "Up")
		if (BTN[BTN_UP].PORT->IDR & BTN[0].PIN) {
		    // Button released
			BTN[BTN_UP].hold_cntr = 0;
			if (BTN[BTN_UP].state != BTN_Hold) BTN[BTN_UP].cntr++;
			BTN[BTN_UP].state = BTN_Released;
		} else {
			// Button pressed
			BTN[BTN_UP].hold_cntr = 0;
			BTN[BTN_UP].state = BTN_Pressed;
		}
		UC1701_SetBacklight(Settings.LCD_brightness);
		_idle_time = 0;
		EXTI_ClearITPendingBit(EXTI_Line5);
	}

	if (EXTI_GetITStatus(EXTI_Line7) != RESET) {
		// EXTI7 (Button#2 -> "Down")
		if (BTN[BTN_DOWN].PORT->IDR & BTN[BTN_DOWN].PIN) {
		    // Button released
			BTN[BTN_DOWN].hold_cntr = 0;
			if (BTN[BTN_DOWN].state != BTN_Hold) BTN[BTN_DOWN].cntr++;
			BTN[BTN_DOWN].state = BTN_Released;
		} else {
			// Button pressed
			BTN[BTN_DOWN].hold_cntr = 0;
			BTN[BTN_DOWN].state = BTN_Pressed;
		}
		UC1701_SetBacklight(Settings.LCD_brightness);
		_idle_time = 0;
		EXTI_ClearITPendingBit(EXTI_Line7);
	}

	if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
		// EXTI6 (nRF24L01 IRQ)
		UC1701_PauseSPI();
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		nRF24_ClearIRQFlags();
		UC1701_ResumeSPI();
		_no_signal_time = 0;
		EXTI_ClearITPendingBit(EXTI_Line6);
//		if (RX_status == nRF24_RX_PCKT_PIPE0) _new_packet = TRUE;
		if (RX_status == nRF24_RX_PCKT_PIPE0) ParsePacket();
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	if (EXTI_GetITStatus(EXTI_Line10) != RESET) {
		// EXTI10 (Button#3 -> "Enter")
		if (BTN[BTN_ENTER].PORT->IDR & BTN[BTN_ENTER].PIN) {
		    // Button released
			BTN[BTN_ENTER].hold_cntr = 0;
			if (BTN[BTN_ENTER].state != BTN_Hold) BTN[BTN_ENTER].cntr++;
			BTN[BTN_ENTER].state = BTN_Released;
		} else {
			// Button pressed
			BTN[BTN_ENTER].hold_cntr = 0;
			BTN[BTN_ENTER].state = BTN_Pressed;
		}
		UC1701_SetBacklight(Settings.LCD_brightness);
		_idle_time = 0;
		EXTI_ClearITPendingBit(EXTI_Line10);
	}

	if (EXTI_GetITStatus(EXTI_Line11) != RESET) {
		// EXTI11 (Button#4 -> "Escape")
		if (BTN[BTN_ESCAPE].PORT->IDR & BTN[BTN_ESCAPE].PIN) {
		    // Button released
			BTN[BTN_ESCAPE].hold_cntr = 0;
			if (BTN[BTN_ESCAPE].state != BTN_Hold) BTN[BTN_ESCAPE].cntr++;
			BTN[BTN_ESCAPE].state = BTN_Released;
		} else {
			// Button pressed
			BTN[BTN_ESCAPE].hold_cntr = 0;
			BTN[BTN_ESCAPE].state = BTN_Pressed;
		}
		UC1701_SetBacklight(Settings.LCD_brightness);
		_idle_time = 0;
		EXTI_ClearITPendingBit(EXTI_Line11);
	}
}

// RTC wakeup IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC_GetITStatus(RTC_IT_WUT)) {
		// RTC Wakeup interrupt
		RTC_GetTime(RTC_Format_BIN,&RTC_Time);
		RTC_GetDate(RTC_Format_BIN,&RTC_Date);

		_no_signal_time++;
		if (_no_signal_time > 3600) _no_signal_time = 3600; // Counter overflow protection (1hour)
		if (_no_signal_time > NO_SIGNAL_TIME) {
			CurData.Speed = 0;
			CurData.Cadence = 0;
		}

		_idle_time++;
		if (_idle_time > 3600) _idle_time = 3600; // Counter overflow protection (1hour)
		if (_idle_time > LCD_BACKLIGHT_TIMEOUT)	UC1701_SetBacklight(0); else UC1701_SetBacklight(Settings.LCD_brightness);

		_altitude_duty_cycle++;
		// WARNING! This is really slow! Call it from this place is a really bad idea!
		if (_altitude_duty_cycle > ALT_MEASURE_DUTY_CYCLE) UpdateBMP180();

		_new_time = TRUE;

		RTC_ClearITPendingBit(RTC_IT_WUT);
		RTC_ClearFlag(RTC_FLAG_WUTF);
		EXTI_ClearITPendingBit(EXTI_Line20);
	}
}

