LonelyWolf/stm32/bike-computer/main.c
	// Configure EXTI15_10 interrupt
	NVICInit.NVIC_IRQChannel = EXTI15_10_IRQn;
	NVIC_Init(&NVICInit);

	// PA5 -> EXTI line 5 (Button#1)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource5);
	// Configure EXTI on Line5
	EXTIInit.EXTI_Line = EXTI_Line5;              // EXTI will be on line 5
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;     // Generate IRQ
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Rising_Falling; // IRQ on edge fall
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);

	// PA7 -> EXTI line 7  (Button#2)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource7);
	// Configure EXTI on Line7
	EXTIInit.EXTI_Line = EXTI_Line7;              // EXTI will be on line 7
	EXTI_Init(&EXTIInit);

	// PC10 -> EXTI line 10  (Button#3)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource10);
	// Configure EXTI on Line10
	EXTIInit.EXTI_Line = EXTI_Line10;             // EXTI will be on line 10
	EXTI_Init(&EXTIInit);

	// PC10 -> EXTI line 11  (Button#4)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource11);
	// Configure EXTI on Line11
	EXTIInit.EXTI_Line = EXTI_Line11;             // EXTI will be on line 11
	EXTI_Init(&EXTIInit);

	// RTC wakeup -> EXTI line 20
	EXTIInit.EXTI_Line = EXTI_Line20;             // RTC wakeup on EXTI line 20
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;     // Generate IRQ
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Rising;  // IRQ on rising edge
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);
	// RTC wakeup IRQ
	NVICInit.NVIC_IRQChannel = RTC_WKUP_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0f; // 0x0f - lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x0f;
	NVIC_Init(&NVICInit);

/*********************************************
    // Output clock on MCO pin (PA8)
	PORT.GPIO_Pin = GPIO_Pin_8;
	PORT.GPIO_Mode = GPIO_Mode_AF;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_Speed = GPIO_Speed_40MHz;
    GPIO_Init(GPIOA,&PORT);
	GPIO_PinAFConfig(GPIOA,GPIO_PinSource8,GPIO_AF_MCO); // Alternative function on PA8 -> SYS_MCO
//    RCC_MCOConfig(RCC_MCOSource_HSE,RCC_MCODiv_2); // Route HSE clock to MCO pin
    RCC_MCOConfig(RCC_MCOSource_LSE,RCC_MCODiv_2); // Route LSE clock to MCO pin
//    RCC_MCOConfig(RCC_MCOSource_SYSCLK,RCC_MCODiv_2); // Route System clock to MCO pin
//    RCC_MCOConfig(RCC_MCOSource_PLLCLK,RCC_MCODiv_4); // Route PLL clock to MCO pin
**********************************************/

//	Delay_ms(2500); // Fancy startup delay

	UC1701_Fill(0x00);
    UC1701_Flush();

	// Set custom time for debug purposes
	RTC_Time.RTC_Hours   = 23;
	RTC_Time.RTC_Minutes = 58;
	RTC_Time.RTC_Seconds = 51;
	RTC_SetTime(RTC_Format_BIN,&RTC_Time);
	RTC_Date.RTC_Date    = 16;
	RTC_Date.RTC_Month   = 04;
	RTC_Date.RTC_Year    = 14;
	RTC_Date.RTC_WeekDay = 3;
	RTC_SetDate(RTC_Format_BIN,&RTC_Date);

//	GPS_SendCommand("$PMTK104*"); // Reset EB500 to factory settings
//	GPS_SendCommand("$PMTK314,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1*"); // All sentences
//	GPS_SendCommand("$PMTK314,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GLL
//	GPS_SendCommand("$PMTK314,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // RMC
//	GPS_SendCommand("$PMTK314,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // VTG
//	GPS_SendCommand("$PMTK314,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GGA
//	GPS_SendCommand("$PMTK314,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GSA
//	GPS_SendCommand("$PMTK314,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GSV
//	GPS_SendCommand("$PMTK314,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0*"); // ZDA
	GPS_SendCommand("$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0*"); // All supported sentences
	GPS_SendCommand("$PMTK101*"); // Hot restart

	ccc = 0;

	// Reinitialize delay timer with callback function
	Delay_Init(callback_Delay);


/////////////////////////////////////////////////////////////////////////
//	Main loop
/////////////////////////////////////////////////////////////////////////

	while(1) {
		if (_new_packet) {
			GUI_refresh = TRUE;
			_RF_icon = !_RF_icon;
			_new_packet = FALSE;
		}

		if (_new_time) {
			GUI_refresh = TRUE;
			_new_time = FALSE;
		}

		if (GPS_new_data) {
			if (GPSData.datetime_valid) {
				// Date and time obtained from GPS
				RTC_Time.RTC_Hours   =  GPSData.time / 3600;
				RTC_Time.RTC_Minutes = (GPSData.time / 60) % 60;
				RTC_Time.RTC_Seconds =  GPSData.time % 60;
				i = GPSData.date / 1000000;
				RTC_Date.RTC_Date  = i;
				RTC_Date.RTC_Month = (GPSData.date - (i * 1000000)) / 10000;
				RTC_Date.RTC_Year  = (GPSData.date % 10000) - 2000;
				RTC_AdjustTimeZone(&RTC_Time,&RTC_Date,Settings.GMT_offset);
				RTC_SetTime(RTC_Format_BIN,&RTC_Time);
				RTC_SetDate(RTC_Format_BIN,&RTC_Date);
			}
			GPSData.datetime_valid = FALSE;
			GPSData.time_valid = FALSE;
			GPS_new_data = FALSE;
		}

		// "Up" button pressed - just clear the counter, there is no function yet
		if (BTN[BTN_UP].cntr > 0) {
			BTN[BTN_UP].cntr = 0;
		}

		// "Down" button pressed - just clear the counter, there is no function yet
		if (BTN[BTN_DOWN].cntr > 0) {
			BTN[BTN_DOWN].cntr = 0;
		}

		// "Enter" button hold - show main menu
		if (BTN[BTN_ENTER].state == BTN_Hold || BTN[BTN_ENTER].cntr) {
			GUI_MainMenu();
		}

		// "Escape" button pressed - just clear the counter, there is no function for yet
		if (BTN[BTN_ESCAPE].cntr) BTN[BTN_ESCAPE].cntr = 0;

		UC1701_Fill(0x00);
		GUI_DrawSpeed(scr_width - 55,0,CurData.Speed,CurData.AvgSpeed);

		HLine(0,scr_width - 1,scr_height - 29,PSet);
		VLine(67,0,scr_height - 1,PSet);

		// RF icon
		if (_no_signal_time > NO_SIGNAL_TIME)
			GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[65]);
		else if (_RF_icon) {
			GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[39]);
		} else {
			GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[52]);
		}

		if (GPSData.fix != 2 && GPSData.fix != 3)
			GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[26]);
		else if (GPSData.fix == 2) GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[0]);
		else GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[13]);

		PutStr5x7(scr_width - 30,scr_height - 27,"CDC",CT_opaque);
		if (_no_signal_time > NO_SIGNAL_TIME) {
			for (i = 0; i < 3; i++)	FillRect(scr_width - (i * 10) - 15,scr_height - 3,scr_width - (i * 10) - 7,scr_height - 1,PSet);
		} else {
			GUI_DrawNumber(-scr_width + 7,-scr_height + 1,CurData.Cadence,0,DS_Small);
		}
		GUI_DrawBitmap(scr_width - 5,scr_height - 19,5,19,&small_signs[15]);

		PutStr5x7(3,scr_height - 27,"Ride Time",CT_opaque);
		GUI_DrawRideTime(0,scr_height - 19,CurData.TripTime);

		PutStr5x7(0,18,"Alt:",CT_opaque);
		PutChar5x7(23 + PutInt5x7(23,18,CurData.Altitude,CT_opaque),18,'m',CT_opaque);
		GUI_PutTemperature5x7(0,26,CurData.Temperature,CT_opaque);

/*
		// Time "screensaver"
		GUI_DrawTime(12,16,&RTC_Time,TT_Full,DS_Big);
		GUI_PutDate5x7(33,scr_height - 7,(RTC_Date.RTC_Date * 1000000) + (RTC_Date.RTC_Month * 10000) + RTC_Date.RTC_Year + 2000,CT_opaque);
*/

		ccc++;
/*
		i = PutInt5x7(3,3,ccc,CT_opaque);
		Rect(0,0,i + 4,12,PReset);
		Rect(1,1,i + 3,11,PSet);
		Rect(2,2,i + 2,10,PReset);
*/

		UC1701_Flush();
		GUI_refresh = FALSE;

		SleepWait(); // Sleep mode
	}

	// Something awful will happen when you reach this point
}
